/**
 * @file   	main.c
 * @author 	m.isaev
 * @version
 * @date 	18 сент. 2018 г.
 * @brief
 */


/*#### |Begin| --> Секция - "Include" ########################################*/
#include "main.h"
/*#### |End  | <-- Секция - "Include" ########################################*/


/*#### |Begin| --> Секция - "Глобальные переменные" ##########################*/
/*#### |End  | <-- Секция - "Глобальные переменные" ##########################*/


/*#### |Begin| --> Секция - "Локальные переменные" ###########################*/
/*#### |End  | <-- Секция - "Локальные переменные" ###########################*/


/*#### |Begin| --> Секция - "Прототипы локальных функций" ####################*/
/*#### |End  | <-- Секция - "Прототипы локальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание глобальных функций" ####################*/
int main(
	void)
{
	/*=== |Begin| --> Секция - "Конфигурирование периферии микроконтроллера" =*/

	/* Конфигурирование тактового генератора */
	LL_RCC_Init_HSI_16MHz_HCLK_80MHz();

	/* Конфигурирование модуля USART 2 для передачи отладочной информации */
	UFD_Init_All_USART2_TxRx_DMA1_Channel7_IO_Ports(
		9600u);

	/*=== |End  | <-- Секция - "Конфигурирование периферии микроконтроллера" =*/

	/* Loop */
	while (1)
	{

	}

	return (1);
}
/*#### |End  | <-- Секция - "Описание глобальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание локальных функций" #####################*/
/*#### |End  | <-- Секция - "Описание локальных функций" #####################*/


/*############################################################################*/
/*############################ END OF FILE  ##################################*/
/*############################################################################*/
