/**
 * @file   	rcc.c
 * @author 	m.isaev
 * @version
 * @date 	18 сент. 2018 г.
 * @brief
 */


/*#### |Begin| --> Секция - "Include" ########################################*/
#include "rcc.h"
/*#### |End  | <-- Секция - "Include" ########################################*/


/*#### |Begin| --> Секция - "Глобальные переменные" ##########################*/
/*#### |End  | <-- Секция - "Глобальные переменные" ##########################*/


/*#### |Begin| --> Секция - "Локальные переменные" ###########################*/
/*#### |End  | <-- Секция - "Локальные переменные" ###########################*/


/*#### |Begin| --> Секция - "Прототипы локальных функций" ####################*/
/*#### |End  | <-- Секция - "Прототипы локальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание глобальных функций" ####################*/
void
LL_RCC_Init_HSI_16MHz_HCLK_80MHz(
	void)
{
	LL_RCC_DeInit();

	__HAL_RCC_PWR_CLK_ENABLE();
	__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

	LL_UTILS_PLLInitTypeDef PLL_Init_s;
	PLL_Init_s.PLLM	= LL_RCC_PLLM_DIV_1;
	PLL_Init_s.PLLN = 10u;
	PLL_Init_s.PLLR = LL_RCC_PLLR_DIV_2;

	LL_UTILS_ClkInitTypeDef CLK_Init_s;
	CLK_Init_s.AHBCLKDivider 	= LL_RCC_SYSCLK_DIV_1;
	CLK_Init_s.APB1CLKDivider 	= LL_RCC_APB1_DIV_1;
	CLK_Init_s.APB2CLKDivider 	= LL_RCC_APB2_DIV_1;

	LL_PLL_ConfigSystemClock_HSI(
		&PLL_Init_s,
		&CLK_Init_s);
}
/*#### |End  | <-- Секция - "Описание глобальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание локальных функций" #####################*/
/*#### |End  | <-- Секция - "Описание локальных функций" #####################*/


/*############################################################################*/
/*############################ END OF FILE  ##################################*/
/*############################################################################*/
